xrun(64): 23.03-s002: (c) Copyright 1995-2023 Cadence Design Systems, Inc.
TOOL:	xrun(64)	23.03-s002: Started on Apr 02, 2025 at 11:39:30 CEST
xrun
	+sv
	-64bit
	-f files_verilog.f
		../Verilog/RTL/alu.v
		../Verilog/RTL/alu_control.v
		../Verilog/RTL/branch_unit.v
		../Verilog/RTL/control_unit.v
		../Verilog/RTL/cpu.v
		../Verilog/RTL/immediate_extend_unit.v
		../Verilog/RTL/mux_2.v
		../Verilog/RTL/pc.v
		../Verilog/RTL/register_file.v
		../Verilog/RTL/reg_arstn.v
		../Verilog/RTL/reg_arstn_en.v
		../Verilog/RTL/sram.v
		../Verilog/cpu_tb.v
		../Verilog/sky130_sram_2rw.v
	-top cpu_tb
	-timescale 1ns/10ps
	-access +rwc
	-allowredefinition
	-linedebug
	-gui
xrun: *W,BADPRF: The -linedebug option may have an adverse performance impact.
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /esat/micas-data/software/Cadence/xcelium_23.03/tools/xcelium/files/xmsimrc
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm cpu_tb.wen_ext cpu_tb.ren_ext
Created probe 1
xcelium> run

Start Execution

[1;31m
Error in Mult2 function
[0m
Debug info, reg_array[          0]: 0000000000000000
Debug info, reg_array[          1]: 0000000000000000
Debug info, reg_array[          2]: 0000000000000000
Debug info, reg_array[          3]: 0000000000000000
Debug info, reg_array[          4]: 0000000000000000
Debug info, reg_array[          5]: 0000000000000000
Debug info, reg_array[          6]: 0000000000000000
Debug info, reg_array[          7]: 0000000000000000
Debug info, reg_array[          8]: 0000000000000000
Debug info, reg_array[          9]: 0000000000000000
Debug info, reg_array[         10]: 0000000000000000
Debug info, reg_array[         11]: 0000000000000001
Debug info, reg_array[         12]: 0000000000000002
Debug info, reg_array[         13]: 0000000000000003
Debug info, reg_array[         14]: 0000000000000004
Debug info, reg_array[         15]: 0000000000000005
Debug info, reg_array[         16]: 0000000000000006
Debug info, reg_array[         17]: 0000000000000007
Debug info, reg_array[         18]: 0000000000000008
Debug info, reg_array[         19]: 0000000000000009
Debug info, reg_array[         20]: 000000000000000a
Debug info, reg_array[         21]: 0000000000000000
Debug info, reg_array[         22]: 0000000000000001
Debug info, reg_array[         23]: 0000000000000000
Debug info, reg_array[         24]: 0000000000000000
Debug info, reg_array[         25]: 0000000000000000
Debug info, reg_array[         26]: 0000000000000000
Debug info, reg_array[         27]: 0000000000000000
Debug info, reg_array[         28]: 0000000000000000
Debug info, reg_array[         29]: 0000000000000000
Debug info, reg_array[         30]: 0000000000000000
Debug info, reg_array[         31]: 0000000000000000
         40 cycles
Simulation complete via $finish(1) at time 32450 NS + 8
../Verilog/cpu_tb.v:341    $finish;
xcelium> run
xmsim: *E,RNFNSH: Cannot continue simulation due to a previous $finish.
xcelium> probe -create -shm cpu_tb.wdata_ext
Created probe 2
xcelium> reset
Loaded snapshot worklib.cpu_tb:v
xcelium> run

Start Execution

[1;31m
Error in Mult2 function
[0m
Debug info, reg_array[          0]: 0000000000000000
Debug info, reg_array[          1]: 0000000000000000
Debug info, reg_array[          2]: 0000000000000000
Debug info, reg_array[          3]: 0000000000000000
Debug info, reg_array[          4]: 0000000000000000
Debug info, reg_array[          5]: 0000000000000000
Debug info, reg_array[          6]: 0000000000000000
Debug info, reg_array[          7]: 0000000000000000
Debug info, reg_array[          8]: 0000000000000000
Debug info, reg_array[          9]: 0000000000000000
Debug info, reg_array[         10]: 0000000000000000
Debug info, reg_array[         11]: 0000000000000001
Debug info, reg_array[         12]: 0000000000000002
Debug info, reg_array[         13]: 0000000000000003
Debug info, reg_array[         14]: 0000000000000004
Debug info, reg_array[         15]: 0000000000000005
Debug info, reg_array[         16]: 0000000000000006
Debug info, reg_array[         17]: 0000000000000007
Debug info, reg_array[         18]: 0000000000000008
Debug info, reg_array[         19]: 0000000000000009
Debug info, reg_array[         20]: 000000000000000a
Debug info, reg_array[         21]: 0000000000000000
Debug info, reg_array[         22]: 0000000000000001
Debug info, reg_array[         23]: 0000000000000000
Debug info, reg_array[         24]: 0000000000000000
Debug info, reg_array[         25]: 0000000000000000
Debug info, reg_array[         26]: 0000000000000000
Debug info, reg_array[         27]: 0000000000000000
Debug info, reg_array[         28]: 0000000000000000
Debug info, reg_array[         29]: 0000000000000000
Debug info, reg_array[         30]: 0000000000000000
Debug info, reg_array[         31]: 0000000000000000
         40 cycles
Simulation complete via $finish(1) at time 32450 NS + 8
../Verilog/cpu_tb.v:341    $finish;
xcelium> probe -create -shm cpu_tb.debug_regfile.i
Created probe 3
xcelium> reset
Loaded snapshot worklib.cpu_tb:v
xcelium> run

Start Execution

[1;31m
Error in Mult2 function
[0m
Debug info, reg_array[          0]: 0000000000000000
Debug info, reg_array[          1]: 0000000000000000
Debug info, reg_array[          2]: 0000000000000000
Debug info, reg_array[          3]: 0000000000000000
Debug info, reg_array[          4]: 0000000000000000
Debug info, reg_array[          5]: 0000000000000000
Debug info, reg_array[          6]: 0000000000000000
Debug info, reg_array[          7]: 0000000000000000
Debug info, reg_array[          8]: 0000000000000000
Debug info, reg_array[          9]: 0000000000000000
Debug info, reg_array[         10]: 0000000000000000
Debug info, reg_array[         11]: 0000000000000001
Debug info, reg_array[         12]: 0000000000000002
Debug info, reg_array[         13]: 0000000000000003
Debug info, reg_array[         14]: 0000000000000004
Debug info, reg_array[         15]: 0000000000000005
Debug info, reg_array[         16]: 0000000000000006
Debug info, reg_array[         17]: 0000000000000007
Debug info, reg_array[         18]: 0000000000000008
Debug info, reg_array[         19]: 0000000000000009
Debug info, reg_array[         20]: 000000000000000a
Debug info, reg_array[         21]: 0000000000000000
Debug info, reg_array[         22]: 0000000000000001
Debug info, reg_array[         23]: 0000000000000000
Debug info, reg_array[         24]: 0000000000000000
Debug info, reg_array[         25]: 0000000000000000
Debug info, reg_array[         26]: 0000000000000000
Debug info, reg_array[         27]: 0000000000000000
Debug info, reg_array[         28]: 0000000000000000
Debug info, reg_array[         29]: 0000000000000000
Debug info, reg_array[         30]: 0000000000000000
Debug info, reg_array[         31]: 0000000000000000
         40 cycles
Simulation complete via $finish(1) at time 32450 NS + 8
../Verilog/cpu_tb.v:341    $finish;
xcelium> probe -create -shm cpu_tb.dut.r_currentPC cpu_tb.dut.r_currentPC2
Created probe 4
xcelium> reset
Loaded snapshot worklib.cpu_tb:v
xcelium> run

Start Execution

[1;31m
Error in Mult2 function
[0m
Debug info, reg_array[          0]: 0000000000000000
Debug info, reg_array[          1]: 0000000000000000
Debug info, reg_array[          2]: 0000000000000000
Debug info, reg_array[          3]: 0000000000000000
Debug info, reg_array[          4]: 0000000000000000
Debug info, reg_array[          5]: 0000000000000000
Debug info, reg_array[          6]: 0000000000000000
Debug info, reg_array[          7]: 0000000000000000
Debug info, reg_array[          8]: 0000000000000000
Debug info, reg_array[          9]: 0000000000000000
Debug info, reg_array[         10]: 0000000000000000
Debug info, reg_array[         11]: 0000000000000001
Debug info, reg_array[         12]: 0000000000000002
Debug info, reg_array[         13]: 0000000000000003
Debug info, reg_array[         14]: 0000000000000004
Debug info, reg_array[         15]: 0000000000000005
Debug info, reg_array[         16]: 0000000000000006
Debug info, reg_array[         17]: 0000000000000007
Debug info, reg_array[         18]: 0000000000000008
Debug info, reg_array[         19]: 0000000000000009
Debug info, reg_array[         20]: 000000000000000a
Debug info, reg_array[         21]: 0000000000000000
Debug info, reg_array[         22]: 0000000000000001
Debug info, reg_array[         23]: 0000000000000000
Debug info, reg_array[         24]: 0000000000000000
Debug info, reg_array[         25]: 0000000000000000
Debug info, reg_array[         26]: 0000000000000000
Debug info, reg_array[         27]: 0000000000000000
Debug info, reg_array[         28]: 0000000000000000
Debug info, reg_array[         29]: 0000000000000000
Debug info, reg_array[         30]: 0000000000000000
Debug info, reg_array[         31]: 0000000000000000
         40 cycles
Simulation complete via $finish(1) at time 32450 NS + 8
../Verilog/cpu_tb.v:341    $finish;
xcelium> probe -create -shm cpu_tb.dut.regfile_rdata_1 cpu_tb.dut.regfile_rdata_2 cpu_tb.dut.regfile_waddr cpu_tb.dut.regfile_wdata
Created probe 5
xcelium> reset
Loaded snapshot worklib.cpu_tb:v
xcelium> run

Start Execution

[1;31m
Error in Mult2 function
[0m
Debug info, reg_array[          0]: 0000000000000000
Debug info, reg_array[          1]: 0000000000000000
Debug info, reg_array[          2]: 0000000000000000
Debug info, reg_array[          3]: 0000000000000000
Debug info, reg_array[          4]: 0000000000000000
Debug info, reg_array[          5]: 0000000000000000
Debug info, reg_array[          6]: 0000000000000000
Debug info, reg_array[          7]: 0000000000000000
Debug info, reg_array[          8]: 0000000000000000
Debug info, reg_array[          9]: 0000000000000000
Debug info, reg_array[         10]: 0000000000000000
Debug info, reg_array[         11]: 0000000000000001
Debug info, reg_array[         12]: 0000000000000002
Debug info, reg_array[         13]: 0000000000000003
Debug info, reg_array[         14]: 0000000000000004
Debug info, reg_array[         15]: 0000000000000005
Debug info, reg_array[         16]: 0000000000000006
Debug info, reg_array[         17]: 0000000000000007
Debug info, reg_array[         18]: 0000000000000008
Debug info, reg_array[         19]: 0000000000000009
Debug info, reg_array[         20]: 000000000000000a
Debug info, reg_array[         21]: 0000000000000000
Debug info, reg_array[         22]: 0000000000000001
Debug info, reg_array[         23]: 0000000000000000
Debug info, reg_array[         24]: 0000000000000000
Debug info, reg_array[         25]: 0000000000000000
Debug info, reg_array[         26]: 0000000000000000
Debug info, reg_array[         27]: 0000000000000000
Debug info, reg_array[         28]: 0000000000000000
Debug info, reg_array[         29]: 0000000000000000
Debug info, reg_array[         30]: 0000000000000000
Debug info, reg_array[         31]: 0000000000000000
         40 cycles
Simulation complete via $finish(1) at time 32450 NS + 8
../Verilog/cpu_tb.v:341    $finish;
xcelium> probe -create -shm cpu_tb.dut.register_file.reg_array
Created probe 6
xcelium> reset
Loaded snapshot worklib.cpu_tb:v
xcelium> run

Start Execution

[1;31m
Error in Mult2 function
[0m
Debug info, reg_array[          0]: 0000000000000000
Debug info, reg_array[          1]: 0000000000000000
Debug info, reg_array[          2]: 0000000000000000
Debug info, reg_array[          3]: 0000000000000000
Debug info, reg_array[          4]: 0000000000000000
Debug info, reg_array[          5]: 0000000000000000
Debug info, reg_array[          6]: 0000000000000000
Debug info, reg_array[          7]: 0000000000000000
Debug info, reg_array[          8]: 0000000000000000
Debug info, reg_array[          9]: 0000000000000000
Debug info, reg_array[         10]: 0000000000000000
Debug info, reg_array[         11]: 0000000000000001
Debug info, reg_array[         12]: 0000000000000002
Debug info, reg_array[         13]: 0000000000000003
Debug info, reg_array[         14]: 0000000000000004
Debug info, reg_array[         15]: 0000000000000005
Debug info, reg_array[         16]: 0000000000000006
Debug info, reg_array[         17]: 0000000000000007
Debug info, reg_array[         18]: 0000000000000008
Debug info, reg_array[         19]: 0000000000000009
Debug info, reg_array[         20]: 000000000000000a
Debug info, reg_array[         21]: 0000000000000000
Debug info, reg_array[         22]: 0000000000000001
Debug info, reg_array[         23]: 0000000000000000
Debug info, reg_array[         24]: 0000000000000000
Debug info, reg_array[         25]: 0000000000000000
Debug info, reg_array[         26]: 0000000000000000
Debug info, reg_array[         27]: 0000000000000000
Debug info, reg_array[         28]: 0000000000000000
Debug info, reg_array[         29]: 0000000000000000
Debug info, reg_array[         30]: 0000000000000000
Debug info, reg_array[         31]: 0000000000000000
         40 cycles
Simulation complete via $finish(1) at time 32450 NS + 8
../Verilog/cpu_tb.v:341    $finish;
xcelium> 